seryi2035/stm32002/proj005cmakeC6T6/Core/src/main.c
}
void coilTOback(void) {
  u16 tmp_val_pos=0;
  u16 tmp001 = 0;
  for(u8 m=0;m<32;m++)  {

      if (tmp001 == 0) {
          tmp001 = 1;
        } else {
          tmp001 *= 2;
        }
      //читаем текущее значение
      if (Coils_RW[m]) {
          tmp_val_pos = tmp_val_pos + tmp001;
        }
      if (m == 15) {
          BKP_WriteBackupRegister(BKP_DR1,tmp_val_pos);
          tmp_val_pos = 0;
          tmp001 = 0;
        } else if (m == 31) {
          BKP_WriteBackupRegister(BKP_DR2,tmp_val_pos);
        }
    }
}
void coilFROMback(void) {
  u16 tmp_val_pos;
  tmp_val_pos = BKP_ReadBackupRegister(BKP_DR1);

  for(u8 m=0;m<32;m++)  {
      Coils_RW[m] = tmp_val_pos % 2;
      tmp_val_pos = tmp_val_pos / 2;
      if (m == 15) {
          tmp_val_pos = BKP_ReadBackupRegister(BKP_DR2);
        }
    }
}

/*void TX_16(UART_DATA *MODBUS) {
  uint16_t tmp, tmp1;
  uint16_t m=0,n=0;
  u8 i;
  //MODBUS[0] =SET_PAR[0]; // adress - stays a same as in recived
  //MODBUS[1] = 6; //query type - - stay a same as in recived
  ///2-3  - starting address
  tmp=((((uint16_t)MODBUS->buffer[2])<<8)+MODBUS->buffer[3]); //стратовый адрес для чтения
  //4-5 - number of registers
  tmp1=((((uint16_t)MODBUS->buffer[4])<<8)+MODBUS->buffer[5]);//количество регистров для чтения
  //default answer length if error
  n=3;

  if((((tmp+tmp1)<OBJ_SZ) && (tmp1<MODBUS_WRD_SZ+1)))    {
      for(m=0;m<tmp1;m++)   {
          i = m/2;


          MODBUS->buffer[n]=f001.tmp_val_u8[3];
          MODBUS->buffer[n+1]=f001.tmp_val_u8[2];
          MODBUS->buffer[n+2]=f001.tmp_val_u8[1];
          MODBUS->buffer[n+3]=f001.tmp_val_u8[0];
          f001.tmp_val_float=res_ftable[i+tmp];//пишем текущее значение
          m++; // ############# Второй раз)))))))))))
          n=n+4;
        }
      MODBUS->txlen=8;
    } else {
      //illegal data
      TX_EXCEPTION(MODBUS,0x02) ;
    }

}
*/
void TX_16(UART_DATA *MODBUS) {
  uint16_t tmp, tmp1;
  //uint16_t n=0;
  //u8 i;
  //MODBUS[0] =SET_PAR[0]; // adress - stays a same as in recived
  //MODBUS[1] = 6; //query type - - stay a same as in recived
  ///2-3  - starting address
  tmp=((((uint16_t)MODBUS->buffer[2])<<8)+MODBUS->buffer[3]); //стратовый адрес для чтения
  //2-3  - adress   , 4-5 - number of value 6==2 num bytes 7-8 value
  tmp1=((((uint16_t)MODBUS->buffer[4])<<8)+MODBUS->buffer[5]);//количество регистров для чтения
  //default answer length if error
  //MODBUS->buffer[6] == 2
  //n=7;
  if((((tmp+tmp1)<OBJ_SZ) && (tmp1<MODBUS_WRD_SZ+1)))    {
      hold_reg.tmp_u16[tmp] =((((uint16_t)MODBUS->buffer[7])<<8)+MODBUS->buffer[8]);

      MODBUS->txlen=8;
    } else {
      //illegal data
      TX_EXCEPTION(MODBUS,0x02) ;
    }

}
void rs485GPIOon (void) {
  GPIO_SetBits(GPIOA,GPIO_Pin_11);
  GPIO_ResetBits(GPIOA,GPIO_Pin_8);
}
void rs485GPIOoff (void) {
  GPIO_ResetBits(GPIOA,GPIO_Pin_11);
  GPIO_SetBits(GPIOA,GPIO_Pin_8);
}

void watercounter (void)
{
  if(GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_5)   == (uint8_t)Bit_SET) {

    if (waterplus == 1 ) {
      if (waterpluscount <= 9) {
        waterpluscount++;
          if (waterpluscount == 9) {
          waterplusSET =0;
          }
        } else {
        if (waterplusSET == 0 ) {
          hold_reg.tmp_u32[4] = hold_reg.tmp_u32[4] +5;
          BKP_WriteBackupRegister(BKP_DR27, hold_reg.tmp_u16[8]);
          BKP_WriteBackupRegister(BKP_DR28, hold_reg.tmp_u16[9]);
          waterplusSET =1;
          }
        }
    } else {
    waterplus =1;
    waterpluscount =0;
    }
  }else{
    if (waterplus == 0 ) {
      if (waterpluscount <= 9) {
        waterpluscount++;
          if (waterpluscount == 9) {
          waterplusSET =0;
          }
        } else {
        if (waterplusSET == 0 ) {
          hold_reg.tmp_u32[4] = hold_reg.tmp_u32[4] +5;
          BKP_WriteBackupRegister(BKP_DR27, hold_reg.tmp_u16[8]);
          BKP_WriteBackupRegister(BKP_DR28, hold_reg.tmp_u16[9]);
          waterplusSET =1;
          }
        }
    } else {
    waterplus =0;
    waterpluscount =0;
    }

  }
}


uint8_t OW_Init() {              //инициализирует USART и DMA
  GPIO_InitTypeDef GPIO_InitStruct;
  USART_InitTypeDef USART_InitStructure;

  if (OW_USART == USART1) {
      RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA | RCC_APB2Periph_AFIO,
                             ENABLE);

      // USART TX
      GPIO_InitStruct.GPIO_Pin = GPIO_Pin_9;
      GPIO_InitStruct.GPIO_Mode = GPIO_Mode_AF_PP;
      GPIO_InitStruct.GPIO_Speed = GPIO_Speed_50MHz;

      GPIO_Init(GPIOA, &GPIO_InitStruct);

      // USART RX
      GPIO_InitStruct.GPIO_Pin = GPIO_Pin_10;
      GPIO_InitStruct.GPIO_Mode = GPIO_Mode_IN_FLOATING;
      GPIO_InitStruct.GPIO_Speed = GPIO_Speed_50MHz;

      GPIO_Init(GPIOA, &GPIO_InitStruct);

      RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1, ENABLE);

      RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, ENABLE);
    }

  if (OW_USART == USART2) {
      RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA | RCC_APB2Periph_AFIO,
                             ENABLE);

      GPIO_InitStruct.GPIO_Pin = GPIO_Pin_2;
      GPIO_InitStruct.GPIO_Mode = GPIO_Mode_AF_PP;
      GPIO_InitStruct.GPIO_Speed = GPIO_Speed_50MHz;

      GPIO_Init(GPIOA, &GPIO_InitStruct);

      GPIO_InitStruct.GPIO_Pin = GPIO_Pin_3;
      GPIO_InitStruct.GPIO_Mode = GPIO_Mode_IN_FLOATING;
      GPIO_InitStruct.GPIO_Speed = GPIO_Speed_50MHz;

      GPIO_Init(GPIOA, &GPIO_InitStruct);

      RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART2, ENABLE);

      RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, ENABLE);
    }

  USART_InitStructure.USART_BaudRate = 115200;
  USART_InitStructure.USART_WordLength = USART_WordLength_8b;
  USART_InitStructure.USART_StopBits = USART_StopBits_1;
  USART_InitStructure.USART_Parity = USART_Parity_No;
  USART_InitStructure.USART_HardwareFlowControl =
      USART_HardwareFlowControl_None;
  USART_InitStructure.USART_Mode = USART_Mode_Tx | USART_Mode_Rx;

  USART_Init(OW_USART, &USART_InitStructure);
  USART_Cmd(OW_USART, ENABLE);
  return OW_OK;
}
uint8_t OW_Send(uint8_t sendReset, uint8_t *command, uint8_t cLen,
                uint8_t *data, uint8_t dLen, uint8_t readStart) {
//-----------------------------------------------------------------------------
// процедура общения с шиной 1-wire
// sendReset - посылать RESET в начале общения.
// 		OW_SEND_RESET или OW_NO_RESET
// command - массив байт, отсылаемых в шину. Если нужно чтение - отправляем OW_READ_SLOT
// cLen - длина буфера команд, столько байт отошлется в шину
// data - если требуется чтение, то ссылка на буфер для чтения
// dLen - длина буфера для чтения. Прочитается не более этой длины
// readStart - с какого символа передачи начинать чтение (нумеруются с 0)
//		можно указать OW_NO_READ, тогда можно не задавать data и dLen
//-----------------------------------------------------------------------------


  // если требуется сброс - сбрасываем и проверяем на наличие устройств
  if (sendReset == OW_SEND_RESET) {
      if (OW_Reset() == OW_NO_DEVICE) {
          return OW_NO_DEVICE;
        }
    }

